Feature: Book search feature
 Тест за проверка на търсене на книга

  Scenario: Търсене на книга без попълнени критерии
    Given Потребителя се намира в началния екран
    And Натиска навигационния бутон за търсене на книга
    And Отваря се страницата за търсене на книга
    When Натискане на бутона за търсене
    Then Връща се съобщение "Попълнете някои от критериите"
    
      Scenario: Търсене на книга с попълнени критерии
    Given Потребителя се намира в началния екран
    And Натиска навигационния бутон за търсене на книга
    And Отваря се страницата за търсене на книга
    When Въвеждане на isbn : "test123"
    And Въвеждане на title : "testtest"
    And Натискане на бутона за търсене
    Then Връщаме резултат по критерия
    
     Scenario: Търсене на книга с попълнена критерия,но без резултат
    Given Потребителя се намира в началния екран
    And Натиска навигационния бутон за търсене на книга
    And Отваря се страницата за търсене на книга
    When Въвеждане на isbn : "test1234"
    And Натискане на бутона за търсене
    Then Връщаме празен резултат
