Feature: Book creatinon feature
  Тест за проверка на създаване на книги

  Scenario: Създаване на книга без попълнени полети
    Given Потребителя се намира на началната страница
    And Натиска навигационния бутон за създаване на книга
    And Отваря се формата за създаване на книга
    When Натискане на бутона за създаване на книга
    Then Изскача съобщение "Попълнете всички полета"

  Scenario: Създаване на книга с едно попълнено поле (title)
    Given Потребителя се намира на началната страница
    And Натиска навигационния бутон за създаване на книга
    And Отваря се формата за създаване на книга
    When Въвеждане на полето title : "test"
    And Натискане на бутона за създаване на книга
    Then Изскача съобщение "Попълнете всички полета"
    
      Scenario: Създаване на книга с едно попълнено поле (isbn)
    Given Потребителя се намира на началната страница
    And Натиска навигационния бутон за създаване на книга
    And Отваря се формата за създаване на книга
    When Въвеждане на полето isbn : "test"
    And Натискане на бутона за създаване на книга
    Then Изскача съобщение "Попълнете всички полета"

  Scenario: Създаване на книга с валидни данни
    Given Потребителя се намира на началната страница
    And Натиска навигационния бутон за създаване на книга
    And Отваря се формата за създаване на книга
    When Въвеждане на полето isbn : "isbn"
    And Въвеждане на полето title : "test"
    And Натискане на бутона за създаване на книга
    Then Изскача съобщение "Успешно създаване"
